// NEWTEXTRPG.cpp : 이 파일에는 'main' 함수가 포함됩니다. 거기서 프로그램 실행이 시작되고 종료됩니다.
//

#include "GameFunctions.h"


int main()
{   

   GameStart();
   return 0;
     
}

//마을, 사냥터
    //캐릭, 몬스터
    //전투(공격, 방어)
    //캐릭선택
    //게임파일 -> 초반 시작 유무
    //마을 -> 사냥한다, 캐릭 선택창으로 돌아간다가 뜨는 곳
    // 직업 선택창 -> 말그대로 직업 선택창
    //사냥터 -> 싸운다, 마을로 돌아간다 + 때린다 막는다, 계속 사냥하냐까지 보여주는 곳
    //몬스터 -> 사냥터에서 등장해서 상대와 싸우는 놈
    //캐릭 -> 초반에 생성해서 모든 곳을 돌아다니는 놈

// 프로그램 실행: <Ctrl+F5> 또는 [디버그] > [디버깅하지 않고 시작] 메뉴
// 프로그램 디버그: <F5> 키 또는 [디버그] > [디버깅 시작] 메뉴

// 시작을 위한 팁: 
//   1. [솔루션 탐색기] 창을 사용하여 파일을 추가/관리합니다.
//   2. [팀 탐색기] 창을 사용하여 소스 제어에 연결합니다.
//   3. [출력] 창을 사용하여 빌드 출력 및 기타 메시지를 확인합니다.
//   4. [오류 목록] 창을 사용하여 오류를 봅니다.
//   5. [프로젝트] > [새 항목 추가]로 이동하여 새 코드 파일을 만들거나, [프로젝트] > [기존 항목 추가]로 이동하여 기존 코드 파일을 프로젝트에 추가합니다.
//   6. 나중에 이 프로젝트를 다시 열려면 [파일] > [열기] > [프로젝트]로 이동하고 .sln 파일을 선택합니다.
